package lesson_11;

// На компьютере будет создан файл Hello.java
// Ctr + / - закомментировать строку
// /* ... */
// Ctrl + Y - Удаление строки

// Функция в Python = метод в Java - набор инструкций, которые выполняются вместе.
// Метод main = специальный метод, который говорит Java с чего начинать выполнять программу

// Shift + F6 = переименовать клас, переменную и тд.

public class Hello {
    /*
    1. Команда 1
    2. Команда 2
    */
    // 1. psvm;  2. main
    public static void main(String[] args) {
        // Это инструкция, которая будет выполнена при запуске класса Hello
        // sout
        System.out.println("Hello, World!");
    }
}